In [1]:
import os
parentDirectory = os.path.abspath(os.path.join(os.getcwd(), os.pardir))
import seaborn as sns

In [2]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression
from sklearn.linear_model import LogisticRegression
bank = pd.read_csv(os.path.join(parentDirectory, 'data', 'advertising.csv'))#,delimiter=';',header=None)

bank.head()

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3   12.0
3  151.5   41.3       58.5   16.5
4  180.8   10.8       58.4   17.9

In [3]:
bank.dtypes

TV           float64
Radio        float64
Newspaper    float64
Sales        float64
dtype: object

In [4]:
bank.describe()

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   15.130500
std     85.854236   14.846809   21.778621    5.283892
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   11.000000
50%    149.750000   22.900000   25.750000   16.000000
75%    218.825000   36.525000   45.100000   19.050000
max    296.400000   49.600000  114.000000   27.000000

In [5]:
clean_bank=bank.dropna()

In [6]:
#sns.heatmap(bank.select_dtypes(include=['int', 'float' ]), cmap ='RdYlGn', linewidths = 0.30, annot = True)
bank.select_dtypes(include=['int', 'float' ]).dropna()

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3   12.0
3    151.5   41.3       58.5   16.5
4    180.8   10.8       58.4   17.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1   14.0
197  177.0    9.3        6.4   14.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   18.4

[200 rows x 4 columns]

In [7]:
clean_bank.to_csv(os.path.join(parentDirectory, 'data', 'bottle_clean.csv'))

In [8]:
clean_bank

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3   12.0
3    151.5   41.3       58.5   16.5
4    180.8   10.8       58.4   17.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1   14.0
197  177.0    9.3        6.4   14.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   18.4

[200 rows x 4 columns]

for i in bank:
  bank[i] = pd.factorize(bank[i])[0].astype(np.uint16)

In [10]:
by=clean_bank[['Sales']].copy()
bX=clean_bank.drop(columns=['Sales'])

In [11]:
by

     Sales
0     22.1
1     10.4
2     12.0
3     16.5
4     17.9
..     ...
195    7.6
196   14.0
197   14.8
198   25.5
199   18.4

[200 rows x 1 columns]

In [12]:
bX

        TV  Radio  Newspaper
0    230.1   37.8       69.2
1     44.5   39.3       45.1
2     17.2   45.9       69.3
3    151.5   41.3       58.5
4    180.8   10.8       58.4
..     ...    ...        ...
195   38.2    3.7       13.8
196   94.2    4.9        8.1
197  177.0    9.3        6.4
198  283.6   42.0       66.2
199  232.1    8.6        8.7

[200 rows x 3 columns]

In [13]:
bclf = LinearRegression()
bclf.fit(bX, by)#,solver='newton-cg' ,solver='liblinear' random_state=0, 
print(bclf.score(bX, by))

0.9025912899684558

In [14]:
from sklearn import svm
mlst=[]
krn=[ "linear", "poly"]#kernels
for j in krn:
    mlst.append(svm.SVR(kernel=j))#new model append with kernel

In [15]:
for i in range(len(mlst)):

    print('-'*20+"kernel "+str(i)+":"+krn[i]+'-'*20)
    
    neigh = mlst[i]
    print("_"*20,type(neigh).__name__,"_"*20)
    neigh.fit(bX, by)
    print(neigh.score(bX, by))

--------------------kernel 0:linear--------------------
____________________ SVR ____________________

C:\Users\kumaran\envs\env1\lib\site-packages\sklearn\utils\validation.py:72: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

0.9008636997581272
--------------------kernel 1:poly--------------------
____________________ SVR ____________________
0.7422212967721913

C:\Users\kumaran\envs\env1\lib\site-packages\sklearn\utils\validation.py:72: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)